app/controllers/line_items_controller.rb

  def create
    debugger
    @cart = current_cart
    @cnt = get_count
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ?  ORDER BY title LIMIT 1  [["id", 8]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-07-24 12:54:51.151848"], ["updated_at", "2014-07-24 12:54:51.151848"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 2], ["created_at", "2014-07-24 12:54:51.375380"], ["product_id", 8], ["updated_at", "2014-07-24 12:54:51.375380"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 4  [["quantity", 2], ["updated_at", "2014-07-24 15:17:26.964490"]]