app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "image_url" = ?, "price" = ?, "title" = ?, "updated_at" = ? WHERE "products"."id" = 980190962  [["description", "Wibbles are fun!"], ["image_url", "lorem.jpg"], ["price", 19.95], ["title", "Lorem Ipsum"], ["updated_at", "2014-07-21 13:39:30.277234"]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT  "products".* FROM "products"  WHERE "products"."id" = ?  ORDER BY title LIMIT 1  [["id", 8]]
---
    def set_product
      @product = Product.find(params[:id])